tutorials/reactiveTransport/reactiveTransportALEFoam/3DcalcitePostALE/0_gold/cellMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      cellMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); 

boundaryField
{
    walls 
    {
        type            zeroGradient;
    }

    outlet 
    {
        type            cellMotion;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            cellMotion;
        value           uniform (0 0 0);
    }
    movingWalls
    {
        type            cellMotion;
        value           uniform (0 0 0); 
    }
}


// ************************************************************************* //
